; domain
(define (domain npuzzle)
            (:requirements :strips :typing)
            
            (:types
                tile position
            )
            
            (:predicates
                (at ?t - tile ?p - position)
                (blank ?p - position)
                (adjacent ?p1 ?p2 - position)
            )
            
            (:action move-tile
                :parameters (?t - tile ?from ?to - position)
                :precondition (and
                (at ?t ?from)
                (blank ?to)
                (adjacent ?from ?to)
                )
                :effect (and
                (at ?t ?to)
                (blank ?from)
                (not (at ?t ?from))
                (not (blank ?to))
                )
            )
            )

; problem
(define (problem npuzzle-instance)
            (:domain npuzzle)
            
            (:objects
                tile1 tile2 tile3 tile4 tile5 tile6 tile7 tile8 - tile
                pos00 pos01 pos02 pos10 pos11 pos12 pos20 pos21 pos22 - position
            )
            
            (:init
                    (adjacent pos00 pos01)
    (adjacent pos00 pos10)
    (adjacent pos01 pos00)
    (adjacent pos01 pos02)
    (adjacent pos01 pos11)
    (adjacent pos02 pos01)
    (adjacent pos02 pos12)
    (adjacent pos10 pos00)
    (adjacent pos10 pos11)
    (adjacent pos10 pos20)
    (adjacent pos11 pos01)
    (adjacent pos11 pos10)
    (adjacent pos11 pos12)
    (adjacent pos11 pos21)
    (adjacent pos12 pos02)
    (adjacent pos12 pos11)
    (adjacent pos12 pos22)
    (adjacent pos20 pos10)
    (adjacent pos20 pos21)
    (adjacent pos21 pos11)
    (adjacent pos21 pos20)
    (adjacent pos21 pos22)
    (adjacent pos22 pos12)
    (adjacent pos22 pos21)
                    (at tile4 pos00)
    (at tile3 pos01)
    (at tile7 pos02)
    (at tile1 pos10)
    (at tile6 pos11)
    (at tile5 pos12)
    (at tile2 pos20)
    (at tile8 pos21)
    (blank pos22)
            )
            
            (:goal
                (and
                      (at tile1 pos00)
      (at tile2 pos01)
      (at tile3 pos02)
      (at tile4 pos10)
      (at tile5 pos11)
      (at tile6 pos12)
      (at tile7 pos20)
      (at tile8 pos21)
                )
            )
            )

; plan
1. (move-tile tile5 pos12 pos22)
   deleted: (at tile5 pos12) (blank pos22)
   added: (at tile5 pos22) (blank pos12)
   goals met: 1 of 8
2. (move-tile tile6 pos11 pos12)
   deleted: (at tile6 pos11) (blank pos12)
   added: (at tile6 pos12) (blank pos11)
   goals met: 2 of 8
3. (move-tile tile1 pos10 pos11)
   deleted: (at tile1 pos10) (blank pos11)
   added: (at tile1 pos11) (blank pos10)
   goals met: 2 of 8
4. (move-tile tile2 pos20 pos10)
   deleted: (at tile2 pos20) (blank pos10)
   added: (at tile2 pos10) (blank pos20)
   goals met: 2 of 8
5. (move-tile tile8 pos21 pos20)
   deleted: (at tile8 pos21) (blank pos20)
   added: (at tile8 pos20) (blank pos21)
   goals met: 1 of 8
6. (move-tile tile5 pos22 pos21)
   deleted: (at tile5 pos22) (blank pos21)
   added: (at tile5 pos21) (blank pos22)
   goals met: 1 of 8
7. (move-tile tile6 pos12 pos22)
   deleted: (at tile6 pos12) (blank pos22)
   added: (at tile6 pos22) (blank pos12)
   goals met: 0 of 8
8. (move-tile tile7 pos02 pos12)
   deleted: (at tile7 pos02) (blank pos12)
   added: (at tile7 pos12) (blank pos02)
   goals met: 0 of 8
9. (move-tile tile3 pos01 pos02)
   deleted: (at tile3 pos01) (blank pos02)
   added: (at tile3 pos02) (blank pos01)
   goals met: 1 of 8
10. (move-tile tile1 pos11 pos01)
   deleted: (at tile1 pos11) (blank pos01)
   added: (at tile1 pos01) (blank pos11)
   goals met: 1 of 8
11. (move-tile tile2 pos10 pos11)
   deleted: (at tile2 pos10) (blank pos11)
   added: (at tile2 pos11) (blank pos10)
   goals met: 1 of 8
12. (move-tile tile4 pos00 pos10)
   deleted: (at tile4 pos00) (blank pos10)
   added: (at tile4 pos10) (blank pos00)
   goals met: 2 of 8
13. (move-tile tile1 pos01 pos00)
   deleted: (at tile1 pos01) (blank pos00)
   added: (at tile1 pos00) (blank pos01)
   goals met: 3 of 8
14. (move-tile tile2 pos11 pos01)
   deleted: (at tile2 pos11) (blank pos01)
   added: (at tile2 pos01) (blank pos11)
   goals met: 4 of 8
15. (move-tile tile5 pos21 pos11)
   deleted: (at tile5 pos21) (blank pos11)
   added: (at tile5 pos11) (blank pos21)
   goals met: 5 of 8
16. (move-tile tile8 pos20 pos21)
   deleted: (at tile8 pos20) (blank pos21)
   added: (at tile8 pos21) (blank pos20)
   goals met: 6 of 8
17. (move-tile tile4 pos10 pos20)
   deleted: (at tile4 pos10) (blank pos20)
   added: (at tile4 pos20) (blank pos10)
   goals met: 5 of 8
18. (move-tile tile5 pos11 pos10)
   deleted: (at tile5 pos11) (blank pos10)
   added: (at tile5 pos10) (blank pos11)
   goals met: 4 of 8
19. (move-tile tile7 pos12 pos11)
   deleted: (at tile7 pos12) (blank pos11)
   added: (at tile7 pos11) (blank pos12)
   goals met: 4 of 8
20. (move-tile tile6 pos22 pos12)
   deleted: (at tile6 pos22) (blank pos12)
   added: (at tile6 pos12) (blank pos22)
   goals met: 5 of 8
21. (move-tile tile8 pos21 pos22)
   deleted: (at tile8 pos21) (blank pos22)
   added: (at tile8 pos22) (blank pos21)
   goals met: 4 of 8
22. (move-tile tile7 pos11 pos21)
   deleted: (at tile7 pos11) (blank pos21)
   added: (at tile7 pos21) (blank pos11)
   goals met: 4 of 8
23. (move-tile tile5 pos10 pos11)
   deleted: (at tile5 pos10) (blank pos11)
   added: (at tile5 pos11) (blank pos10)
   goals met: 5 of 8
24. (move-tile tile4 pos20 pos10)
   deleted: (at tile4 pos20) (blank pos10)
   added: (at tile4 pos10) (blank pos20)
   goals met: 6 of 8
25. (move-tile tile7 pos21 pos20)
   deleted: (at tile7 pos21) (blank pos20)
   added: (at tile7 pos20) (blank pos21)
   goals met: 7 of 8
26. (move-tile tile8 pos22 pos21)
   deleted: (at tile8 pos22) (blank pos21)
   added: (at tile8 pos21) (blank pos22)
   goals met: 8 of 8
